       IDENTIFICATION DIVISION.
       PROGRAM-ID. TPL-BAT1.
      *****************************************************************
      * TPL-BAT1: TEMPLATE FOR COBOL BATCH-PROGRAMMS                  *
      *===============================================================*
      * VERSION: V01.00.00 - 08.01.2021 - 11:45 / URIZF               *
      *===============================================================*
      *                                                               *
      * INPUT:                                                        *
      * ======                                                        *
      *                                                               *
      * OUTPUT:                                                       *
      * =======                                                       *
      *                                                               *
      * PROCERSSING:                                                  *
      * ============                                                  *
      *                                                               *
      *===============================================================*
      * AUTHOR: FELIX RIZZOLLI (FR)                        08.01.2021 *
      *===============================================================*
      * CHANGES:                                                      *
      *---------------------------------------------------------------*
      * XX000-V00.00.00            NN                      DD.MM.YYYY *
      *---------------------------------------------------------------*
      *===============================================================*
      * COPYRIGHT: FELIX RIZZOLLI                                     *
      *****************************************************************
       ENVIRONMENT DIVISION.
      *****************************************************************
       CONFIGURATION SECTION.
      *===============================================================*
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      *****************************************************************
       INPUT-OUTPUT SECTION.
      *===============================================================*

       FILE-CONTROL.
      *---------------------------------------------------------------*


      *****************************************************************
       DATA DIVISION.
      *****************************************************************
       FILE SECTION.
      *===============================================================*

      *****************************************************************
       WORKING-STORAGE SECTION.
      *===============================================================*

       COPY 'ERRBWS.cob'.

      *****************************************************************
       PROCEDURE DIVISION.
      *****************************************************************
       MAIN SECTION.
      *===============================================================*
           PERFORM PGM-INIT

           DISPLAY "HELLO WORLD"

           PERFORM PGM-END
           .
       MAIN-EXIT. EXIT.



      *****************************************************************
       PGM-INIT SECTION.
      *===============================================================*
      
      *---------------------------------------------------------------*
      * INITIALIZE VARIABLES                                          *
      *---------------------------------------------------------------*
           MOVE 'TPL-BAT1'                           TO PGM-NAME
           MOVE 'TEMPLATE FOR COBOL BATCH-PROGRAMMS' TO PGM-DESCRIPTION
           MOVE ZERO                                 TO PGM-END-RC
           .
       PGM-INIT-EXIT. EXIT.


           
      *****************************************************************
       PGM-FINISH SECTION.
      *===============================================================*
      
      *---------------------------------------------------------------*
      * MESSAGES                                                      *
      *---------------------------------------------------------------*
           DISPLAY 'INPUT IFILE001......: '
           DISPLAY 'OUTPUT OFILE001.....: '
           MOVE FUNCTION CURRENT-DATE TO PGM-DATE
           DISPLAY PGM-NAME ' ENDE.......: '
             PGM-DATE(1:4) '.' PGM-DATE(5:2) '.' PGM-DATE(7:2) ' '
             PGM-DATE(9:2) ':' PGM-DATE(11:2) ':' PGM-DATE(13:2) ' '
      *    END-DISPLAY
           .
       PGM-FINISH-EXIT. EXIT.



      *****************************************************************
       PGM-END SECTION.
      *===============================================================*
           PERFORM PGM-FINISH.
           IF (PGM-END-RC > '004') THEN
              DISPLAY 'ERROR'
           ELSE
              PERFORM DISPLAY-PGM-END
              MOVE PGM-END-RC TO RETURN-CODE
           END-IF
           GOBACK
           .
       PGM-END-EXIT. EXIT.

      *****************************************************************
      * COPYS                                                         *
      *===============================================================*
       COPY ERRB.
      
      *****************************************************************
       END PROGRAM TPL-BAT1.
      *****************************************************************
