       IDENTIFICATION DIVISION.
       PROGRAM-ID. TPL-BAT1.
      *****************************************************************
      * TPL-BAT1: TEMPLATE FOR COBOL BATCH-PROGRAMMS                  *
      *===============================================================*
      * VERSION: V01.00.00 - 08.01.2021 - 11:45 / URIZF               *
      *===============================================================*
      *                                                               *
      * INPUT:                                                        *
      * ======                                                        *
      *                                                               *
      * OUTPUT:                                                       *
      * =======                                                       *
      *                                                               *
      * PROCERSSING:                                                  *
      * ============                                                  *
      *                                                               *
      *===============================================================*
      * AUTHOR: FELIX RIZZOLLI (FR)                        08.01.2021 *
      *===============================================================*
      * CHANGES:                                                      *
      *---------------------------------------------------------------*
      * XX000-V00.00.00            NN                      DD.MM.YYYY *
      *---------------------------------------------------------------*
      *===============================================================*
      * COPYRIGHT: FELIX RIZZOLLI                                     *
      *****************************************************************
       ENVIRONMENT DIVISION.
      *****************************************************************
       CONFIGURATION SECTION.
      *===============================================================*
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      *****************************************************************
       INPUT-OUTPUT SECTION.
      *===============================================================*

       FILE-CONTROL.
      *---------------------------------------------------------------*


      *****************************************************************
       DATA DIVISION.
      *****************************************************************
       FILE SECTION.
      *===============================================================*

      *****************************************************************
       WORKING-STORAGE SECTION.
      *===============================================================*

       01  PGM-NAME                     PIC  X(8)    VALUE SPACES.
       01  PGM-DATE                     PIC  X(21)   VALUE SPACES.
       01  PGM-DESCRIPTION              PIC  X(71)   VALUE SPACES.

      *****************************************************************
       PROCEDURE DIVISION.
      *****************************************************************
       MAIN SECTION.
      *===============================================================*
           PERFORM PGM-INIT

           DISPLAY "HELLO WORLD"

           PERFORM PGM-END
           .
       MAIN-EXIT. EXIT.

      *****************************************************************
       PGM-INIT SECTION.
      *===============================================================*
           MOVE 'TPL-BAT1'                            TO PGM-NAME
           MOVE 'TEMPLATE FOR COBOL BATCH-PROGRAMMS'  TO PGM-DESCRIPTION
           .
       PGM-INIT-EXIT. EXIT.

      *****************************************************************
       PGM-END SECTION.
      *===============================================================*
           GOBACK
           .
       PGM-END-EXIT. EXIT.

      *****************************************************************
       END PROGRAM TPL-BAT1.
      *****************************************************************
