       FD  :V1:                                      
           RECORDING F                               
           LABEL RECORD STANDARD.                    
       01 :V1:-RECORD                   PIC  X(:V2:).