       FD  :V1:                                                      
           RECORDING V                                               
           RECORD VARYING FROM 1 TO :V2: 
           DEPENDING ON :V1:-LENGTH    
           LABEL RECORD STANDARD.                                    
       01 :V1:-RECORD                   PIC  X(:V2:).                