       01 CREPO1                           PIC X(8) VALUE 'CREPO1'.
       COPY 'LIB/OUTPUT/OFILEWS.cob' REPLACING ==:V1:== BY ==OREPORT==.
       COPY 'LIB/REPORT/CREPO1CA.cob'.    
