       01  PGM-VERSION                  PIC  X(17)   VALUE ' '.
       01  PGM-ERR-RC                   PIC  X(3)    VALUE '999'.
       01  PGM-ERR-MSG1                 PIC  X(100)  VALUE ' '.
       01  PGM-ERR-MSG2                 PIC  X(100)  VALUE ' '.
       01  PGM-ERR-MSG3                 PIC  X(100)  VALUE ' '.
       01  PGM-END-RC                   PIC  X(3)    VALUE '999'.
       01  PGM-END-MSG1                 PIC  X(100)  VALUE ' '.
      *****************************************************************
       01  PGM-NAME                     PIC  X(8)    VALUE SPACES.
       01  PGM-DATE                     PIC  X(21)   VALUE SPACES.
       01  PGM-DESCRIPTION              PIC  X(71)   VALUE SPACES.
