       01 :V1:-COUNT             BINARY PIC S9(9)       VALUE +0.
       01 :V1:-STATUS                   PIC  X(2).               
          88 :V1:-OK                    VALUE '00'.              
          88 :V1:-ERROR                 VALUE '01' THRU '99'.    
